octoevent/app/controllers/event_controller.rb

  def create
    action = params[:action]
    issue = params[:issue]
    if issue
      Event.create('Issue', issue, action)
---
INSERT INTO "events" ("id_git", "action", "node_id", "url", "html_url", "number", "event_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def issue
      puts 'Entrei na Issue'
      event_type = EventType.find_by(name: 'Issue')
      @issues = Event.where(number: params[:id], event_type: event_type)
                .select('*')
---
SELECT "event_types".* FROM "event_types" WHERE "event_types"."name" = $1 LIMIT $2  [["name", "Issue"], ["LIMIT", 1]]
SELECT * FROM "events" WHERE "events"."number" = $1 AND "events"."event_type_id" = $2  [["number", 26], ["event_type_id", 1]]