octoevent/app/views/event/index.json.jbuilder

SELECT "events".* FROM "events"
---
json.events @events.each do |event|